{"id":49143,"date":"2025-03-22T10:20:35","date_gmt":"2025-03-22T04:50:35","guid":{"rendered":"https:\/\/cse.noticebard.com\/?p=49143"},"modified":"2025-03-22T10:20:39","modified_gmt":"2025-03-22T04:50:39","slug":"job-post-software-engineer-at-visa","status":"publish","type":"post","link":"https:\/\/cse.noticebard.com\/jobs\/job-post-software-engineer-at-visa\/","title":{"rendered":"JOB POST: Software Engineer at VISA, Bangalore [Hybrid, Full-time, Graduate or 1 Year Exp.]: Apply Now"},"content":{"rendered":"<p><strong><em>Applications are invited for the post of Software Engineer at VISA. Apply Now!<\/em><\/strong><\/p><h2 class=\"wp-block-heading\"><strong>Company Description<\/strong><\/h2><p>Visa is a world leader in payments and technology, with over 259 billion payments transactions flowing safely between consumers, merchants, financial institutions, and government entities in more than 200 countries and territories each year. Our mission is to connect the world through the most innovative, convenient, reliable, and secure payments network, enabling individuals, businesses, and economies to thrive while driven by a common purpose – to uplift everyone, everywhere by being the best way to pay and be paid.<br><br>Make an impact with a purpose-driven industry leader. Join us today and experience Life at Visa.<\/p><h2 class=\"wp-block-heading\"><strong>Job Description<\/strong><\/h2><p>As a Software Engineer, you will be part of our VPC &amp; Domestic Processing team in Payment Processing to help design, enhance and build our transactional processing system in an agile development environment. You will work with colleagues who will support and challenge you daily. You will be part of teams tasked with multiple projects building full stack development of real-time transactional services, REST services API and Container based services that are highly functional, distributed, secure, scalable and resilient.<\/p><p>We believe in self managing Agile teams who build products end to end focusing on unit testing, code reviews and continuous integration for excellent code quality. You will see the code written and moved to production within just a few days, to then be used by a huge customer base including Facebook, Nike, FedEx, Apple to name a few. As part of this organization , you will get an opportunity to work on a highly scalable system which processes around 400+ tps 24\/7.<\/p><h2 class=\"wp-block-heading\"><strong>Key Responsibilities<\/strong><\/h2><ul class=\"wp-block-list\"><li>As a Software Engineer you will help design, enhance, and build next generation fraud detection platforms in     an agile development environment.<\/li>\n\n<li>You will play part of multiple teams tasked with projects ranging from backend development, Rest based APIs, Container based services to highly functional, secure, scalable, and resilient systems.<\/li>\n\n<li>Contribute to release planning exercise, assign, and track work of team members to timely releases.<\/li>\n\n<li>Responsibilities include technical analysis and creation of conceptual approach.<\/li>\n\n<li>Develop code that complies with design specifications and meets security and Java best practices.<\/li>\n\n<li>Coding must adhere security standards, be easily maintainable and be high performant.<\/li>\n\n<li>Participate in design and code review sessions as appropriate to ensure the quality of work delivered by self and teammates are in accordance with development standards.<\/li>\n\n<li>Collaborate with business partners on requirements elaboration, design, configuration, and business re-engineering.<\/li>\n\n<li>Present technical solutions, capabilities, considerations, and features in business terms. Effectively communicate status, issues, and risks in a precise and timely manner.<\/li>\n\n<li>Design and execute test plans, scenarios and scripts<\/li>\n\n<li>Document software defects, using a bug tracking system, and report defects<\/li><\/ul><h2 class=\"wp-block-heading\"><strong>Qualifications<\/strong><\/h2><ul class=\"wp-block-list\"><li>Basic Qualifications<\/li>\n\n<li>Bachelors degree, OR 1+ years of relevant work experience<\/li><\/ul><h2 class=\"wp-block-heading\"><strong>Preferred Qualifications<\/strong><\/h2><p>Bachelor’s degree in Computer Science, Computer Information Systems, Computer Engineering, or related field, and 1 year work experience in the job offered or in a computer-related occupation<\/p><ul class=\"wp-block-list\"><li>Experience in more of the following technologies- Java, Spring MVC, Spring Boot,, MySQL, Maven, Design Patterns, Test Automation framework<\/li>\n\n<li>Ability to present complex ideas in a clear, concise way.<\/li>\n\n<li>Experience with agile development incorporating continuous integration and continuous delivery.<\/li>\n\n<li>Strong facilitation and analytical skills with excellent problem-solving ability<\/li>\n\n<li>Good interpersonal skills and communication<\/li>\n\n<li>Passionate about delivering zero defect code that meet or exceed the proposed defect SLA and have high sense of accountability for quality and timeliness of one’s own deliverables and team deliverables<\/li>\n\n<li>Highly driven, resourceful and results oriented<\/li>\n\n<li>Be systematic and be able to do deep research wanting to uncover the details<\/li>\n\n<li>Have good work ethics, and be a team player to bring the best results as a<\/li>\n\n<li>Bachelor’s degree in Computer Science, Computer Information Systems, Computer Engineering, or related field, and 2 years work experience in the job offered or in a computer-related occupation<\/li>\n\n<li>Experience with agile development incorporating Continuous Integration and Continuous Delivery, utilizing technologies such as GIT, Maven, and Jenkins<\/li>\n\n<li>Experience with successful design, architecture and development using Hadoop, and Spark and Scala for large data processing and transaction systems.<\/li>\n\n<li>Experience with Restful API development<\/li>\n\n<li>Expertise in web applications and webservices, technology standards and frameworks<\/li>\n\n<li>Experienced in test-driven development and test automation and manual testing<\/li>\n\n<li>Experience with build automation tools &#8211; Jenkins, Artifactory, Maven is required, Knowledge of Code Coverage tools like Ecl\/Emma or SonarQube are desired.<\/li>\n\n<li>Experience in card industry or fintech delivering solutions in fraud, risk or payments space will be added advantage.<\/li>\n\n<li>Experience in developing large scale, enterprise class distributed systems of high availability, low latency, &amp; strong data consistency<\/li>\n\n<li>Experience developing instrumentation for software components, to help facilitate real-time and remote troubleshooting\/performance monitoring.<\/li><\/ul><h2 class=\"wp-block-heading\"><strong>How To Apply<\/strong><\/h2><p>Interested candidates can apply through this <a href=\"https:\/\/jobs.smartrecruiters.com\/oneclick-ui\/company\/Visa\/publication\/30d71d0c-ed1a-443d-826c-3510d8991f9b\" target=\"_blank\" rel=\"noopener\">link<\/a>.<\/p><h4 class=\"wp-block-heading\"><strong><a href=\"https:\/\/jobs.smartrecruiters.com\/Visa\/744000049065480-software-engineer-2023-2024-graduates-only-\" target=\"_blank\" rel=\"noreferrer noopener\">Click here to view the official notification of the post of Software Engineer at VISA.<\/a><\/strong><\/h4>","protected":false},"excerpt":{"rendered":"<p>Applications are invited for the post of Software Engineer at VISA. Apply Now! Company Description Visa is a world leader in payments and technology, with over 259 billion payments transactions flowing safely between consumers, merchants, financial institutions, and government entities in more than 200 countries and territories each year. Our mission is to connect the [&hellip;]<\/p>\n","protected":false},"author":380059,"featured_media":49144,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_crosspost_to_32":false,"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":"","_links_to":"","_links_to_target":""},"categories":[8386],"tags":[],"states":[1452],"city":[1552],"category-filter":[],"headline-article":[],"class_list":["post-49143","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-jobs","states-karnataka","city-bengaluru"],"post_thumbnail":"https:\/\/cse.noticebard.com\/wp-content\/uploads\/sites\/23\/2025\/03\/Software-Engineer-at-VISA-150x150.jpg","post_tags_names":[],"author_name":"Varun Guleria","category_name":"Jobs","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/posts\/49143","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/users\/380059"}],"replies":[{"embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/comments?post=49143"}],"version-history":[{"count":4,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/posts\/49143\/revisions"}],"predecessor-version":[{"id":49151,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/posts\/49143\/revisions\/49151"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/media\/49144"}],"wp:attachment":[{"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/media?parent=49143"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/categories?post=49143"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/tags?post=49143"},{"taxonomy":"states","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/states?post=49143"},{"taxonomy":"city","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/city?post=49143"},{"taxonomy":"category-filter","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/category-filter?post=49143"},{"taxonomy":"headline-article","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/headline-article?post=49143"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}