{"id":49256,"date":"2025-03-25T12:26:36","date_gmt":"2025-03-25T06:56:36","guid":{"rendered":"https:\/\/cse.noticebard.com\/?p=49256"},"modified":"2025-03-25T12:26:42","modified_gmt":"2025-03-25T06:56:42","slug":"icssrs-grant","status":"publish","type":"post","link":"https:\/\/cse.noticebard.com\/scholarships\/icssrs-grant\/","title":{"rendered":"ICSSR’s Grant for Participating In International Seminar Abroad [Air Travel, Visa Fee and much more]: Apply Now"},"content":{"rendered":"<p><em><strong>Applications are invited for the ICSSR’s Grant for Participating In International Seminar Abroad. Applications are open throughout the year. <\/strong><\/em><\/p><h2 class=\"wp-block-heading\"><strong>Introduction<\/strong> <strong>to ICSSR&#8217;s Grant<\/strong><\/h2><p>The aim of this programme is to assist invited social science scholars to make substantial contributions to international seminars\/conferences of significant importance. By doing this, it promotes academic links amongst the social scientists in India and abroad, provides opportunity to develop new insights and to enlarge their research perspective and contribute to the advancement and dissemination of knowledge in social science subjects. <\/p><p>Under this scheme, the financial assistance is provided to Indian scholars, who have been invited to contribute and present papers at International Conference abroad.<\/p><h2 class=\"wp-block-heading\"><strong>Domains<\/strong><\/h2><ul class=\"wp-block-list\"><li>Sociology and Social Anthropology;<\/li>\n\n<li>Political Science \/ Public Administration;<\/li>\n\n<li>Economics;<\/li>\n\n<li>International Studies;<\/li>\n\n<li>Social Geography and Population Studies;<\/li>\n\n<li>Commerce and Management;<\/li>\n\n<li>Social Psychology;<\/li>\n\n<li>Education;<\/li>\n\n<li>Social Linguistics \/ Socio-Cultural Studies<\/li>\n\n<li>Law \/ International Law<\/li>\n\n<li>National Security &amp; Strategic Studies;<\/li>\n\n<li>Other allied Social Science disciplines (Library Science, Social Work, Media Studies, Modern Social History, Health Studies, Gender Studies and Environmental Studies, Energy Studies, Diaspora Studies, Area Studies, Sanskrit-Society &amp; Culture, etc.) to promote interdisciplinary and multidisciplinary research.<\/li><\/ul><h2 class=\"wp-block-heading\"><strong>Eligibility<\/strong><\/h2><ul class=\"wp-block-list\"><li>Faculties with regular service in public funded Universities \/ Deemed-to-be-Universities\/Colleges, Institutes of National Importance as defined by MoE \/ UGC, and ICSSR Research Institutes\/Recognized Institutes having a Ph.D degree are eligible to apply.<\/li>\n\n<li>Ph.D\/PDF scholars in the advanced stage of their research are also eligible.<\/li>\n\n<li>Independent scholars having served as Civil servants, officers from Defense services, and other professionals with a social science perspective having not less than 20 years of regular service and demonstrable research experience through publications of books\/research papers\/reports\/policy documents, etc. may also apply<\/li>\n\n<li>If the paper is co-authored, priority will be given to the first author. But a No Objection Certificate (s) from the second author(s) may be attached with the application.<\/li>\n\n<li>Scholars, who have been invited for poster presentation or chair a session or chosen as conveners\/rapporteurs or invited to attend a workshop\/training\/refresher\/summer\/winter course are not eligible.<\/li><\/ul><h2 class=\"wp-block-heading\"><strong>Procedure for Awards<\/strong><\/h2><ul class=\"wp-block-list\"><li>Applications are initially scrutinised by the ICSSR Secretariat.<\/li>\n\n<li>Thereafter an Expert Committee will select the applications on the basis of the research background of the applicant, quality of the paper as well as the reputation of the organizing institution.<\/li>\n\n<li>The recommendations of the Expert Committee are then placed before the Research Committee\/Council for its final approval.<\/li><\/ul><h2 class=\"wp-block-heading\"><strong>Duration and Value<\/strong><\/h2><ul class=\"wp-block-list\"><li>5.1 Faculties will be eligible for financial assistance upto 50% of the total cost of visit under this scheme which include air travel, visa fee, travel insurance, local conveyance, maintenance costs for the period of stay abroad (not exceeding the actual days of conference\/seminar plus travel dates), and registration fee upto US$200. However, the scholars are encouraged to apply for exemption from registration fee which may be available to scholars especially from developing countries.<\/li>\n\n<li>5.2 The faculties belonging to SC\/ST, Persons with Benchmark Disability and Doctoral\/Post-Doctoral scholars (without pay protection) will be considered for full financial assistance, by the expert committee if they have not received any financial assistance from other sources. However, faculties form ICSSR Research Institutes \/ recognized institutes may be considered for 100% of the total cost of the visit on the recommendation of the Expert Committee.<\/li><\/ul><h2 class=\"wp-block-heading\"><strong>Release of Grant<\/strong><\/h2><p>The expenditure will be reimbursed on submission of the original boarding pass, attendance certificate, statement of expenditure and a brief report on the Seminar\/Conference\/ Workshop\/Proceedings.<\/p><h2 class=\"wp-block-heading\"><strong>Monitoring<\/strong><\/h2><p>The ICSSR may ask for a copy of the tickets booked and visa obtained before departure.<\/p><h2 class=\"wp-block-heading\"><strong>Conditions<\/strong><\/h2><ul class=\"wp-block-list\"><li>8.1 The ICSSR expects that its supported papers presented in international seminars etc. be published in high valued journals\/edited books\/impactful reports with due acknowledgement to ICSSR and the commitment about the same from the publisher\/organizers should be submitted along with the Utilization Certificate. The ICSSR also reserves the right to publish such papers presented abroad in its own journals such as Indian Social Science Review, ICSSR Journal of Abstracts and Reviews, etc.<\/li>\n\n<li>8.2 Invitation received from global subject associations\/reputed international organisations\/universities will be given preference. Due consideration would be given to the nature of the peer review process instituted by the conference organizers.<\/li>\n\n<li>8.3 It will be the scholar&#8217;s responsibility to make his\/her travel arrangements i.e. ticket, visa, accommodation, etc.<\/li>\n\n<li>8.4 Application for the second time will be considered only after a gap of three years. However, a scholar can avail the award only twice in his\/her lifetime.<\/li>\n\n<li>8.5 ICSSR follows Government of India Rules &amp; Directives with regard to SC, ST and persons with benchmark disabilities.<\/li>\n\n<li>8.6 The Council reserves the right to reject any application without assigning any reason. It is also not responsible for any postal delays\/loss.<\/li>\n\n<li>8.7 Incomplete applications and those not duly forwarded will not be considered.<\/li>\n\n<li>8.8 The final authority related to the interpretation of the guidelines or any other issue is vested with the ICSSR.<\/li>\n\n<li>8.9 Grants to scholars would be considered only after submission of their full papers for presentation at international conferences.<\/li><\/ul><h2 class=\"wp-block-heading\"><strong>Completion<\/strong><\/h2><p>On completion of the visit the scholar should submit the following<strong>:-<\/strong><\/p><ul class=\"wp-block-list\"><li>9.1 A detailed report on the participation in the conference\/seminar.<\/li>\n\n<li>9.2 Copies of tickets of air travel, visa, original boarding pass, certificate of participation, etc.<\/li><\/ul><h2 class=\"wp-block-heading\"><strong>How to Apply<\/strong><\/h2><ul class=\"wp-block-list\"><li>Apply Through this <a href=\"https:\/\/app.icssr.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">link<\/a>.<\/li>\n\n<li>Applications are received online throughout the year.<\/li>\n\n<li>The applications should be sent at least three months before the due date of the Seminar\/Conference.<\/li>\n\n<li>The ICSSR, in no case, will entertain any application after participation in the Seminar\/Conference.<\/li>\n\n<li>After submitting online application, a hard copy of the same, along with all enclosures, must be sent to: <strong>In-charge, IC Division, Indian Council of Social Science Research, Aruna Asaf Ali Marg, New Delhi 110067<\/strong>.<\/li>\n\n<li>Full paper to be presented should be either in English or Hindi.<\/li><\/ul><h4 class=\"wp-block-heading\"><a href=\"https:\/\/icssr.org\/participation-international-seminar-abroad\" target=\"_blank\" rel=\"noopener\"><strong>Click here to view the official notification<\/strong><\/a><a href=\"https:\/\/icssr.org\/participation-international-seminar-abroad\" target=\"_blank\" rel=\"noreferrer noopener\"><strong> of the ICSSR’s Gran<\/strong><\/a><a href=\"https:\/\/icssr.org\/participation-international-seminar-abroad\" target=\"_blank\" rel=\"noopener\"><strong>t for Participating In International Seminar Abroad.<\/strong><\/a><\/h4><p><strong><a href=\"https:\/\/mu.ac.in\/wp-content\/uploads\/2021\/12\/icssrlogo.jpg\" target=\"_blank\" rel=\"noopener\">Image Sources<\/a><\/strong><\/p><p><\/p>","protected":false},"excerpt":{"rendered":"<p>Applications are invited for the ICSSR’s Grant for Participating In International Seminar Abroad. Applications are open throughout the year. Introduction to ICSSR&#8217;s Grant The aim of this programme is to assist invited social science scholars to make substantial contributions to international seminars\/conferences of significant importance. By doing this, it promotes academic links amongst the social [&hellip;]<\/p>\n","protected":false},"author":380059,"featured_media":49262,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_crosspost_to_32":false,"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"footnotes":"","_links_to":"","_links_to_target":""},"categories":[8374],"tags":[],"states":[],"city":[],"category-filter":[],"headline-article":[],"class_list":["post-49256","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-scholarships"],"post_thumbnail":"https:\/\/cse.noticebard.com\/wp-content\/uploads\/sites\/23\/2025\/03\/ICSSRs-Grant-for-Participating-In-International-Seminar-Abroad-150x150.jpg","post_tags_names":[],"author_name":"Varun Guleria","category_name":"Scholarships","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/posts\/49256","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/users\/380059"}],"replies":[{"embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/comments?post=49256"}],"version-history":[{"count":2,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/posts\/49256\/revisions"}],"predecessor-version":[{"id":49263,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/posts\/49256\/revisions\/49263"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/media\/49262"}],"wp:attachment":[{"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/media?parent=49256"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/categories?post=49256"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/tags?post=49256"},{"taxonomy":"states","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/states?post=49256"},{"taxonomy":"city","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/city?post=49256"},{"taxonomy":"category-filter","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/category-filter?post=49256"},{"taxonomy":"headline-article","embeddable":true,"href":"https:\/\/cse.noticebard.com\/wp-json\/wp\/v2\/headline-article?post=49256"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}